# PopTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..PopTransform Method
ExporterIFC Class See Also
---
Resets the internal transform of the exporter to process the previously active input element (if any), or the default transform if the stack is empty.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void PopTransform()
```

Visual Basic
---
```text
Public Sub PopTransform
```

Visual C++
---
```text
public:
void PopTransform()
```

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace